const zoneMap = [
  //서울
  ['', '', ''],
  ['서울', '', '1'],
  ['서울', '강남/역삼/선릉/삼성', '2'],
  ['서울', '서초/교대/방배', '3'],
  ['서울', '홍대/합정/상수', '4'],
  ['서울', '신촌/이대/아현/연희', '5'],
  ['서울', '광화문/종로', '6'],
  ['서울', '압구정/신사/논현/청담', '7'],
  ['서울', '낙성대/서울대입구/신림', '8'],
  ['서울', '도곡/대치/개포/수서', '9'],
  ['서울', '마곡/방화/목동/신정', '10'],
  ['서울', '망원/연남/성산/상암', '11'],
  ['서울', '을지로/신당/동대문', '12'],
  ['서울', '사당/이수/노량진/대방', '13'],
  ['서울', '건대/구의/군자', '14'],
  ['서울', '선유도/당산/여의도', '15'],
  ['서울', '성수/왕십리/서울숲', '16'],
  ['서울', '수유/미아/방학', '17'],
  ['서울', '명동/회현/충무로', '18'],
  ['서울', '영등포/문래/신길/대림', '19'],
  ['서울', '이태원/용산/후암', '20'],
  ['서울', '제기/청량/회기', '21'],
  ['서울', '천호/길동', '22'],
  ['서울', '공덕/마포/대흥', '23'],
  ['서울', '성북/길음/안암', '24'],
  ['서울', '잠실/송파/방이', '25'],
  ['서울', '불광/연신내', '26'],
  ['서울', '공릉/상계/면목/상봉', '27'],
  ['서울', '대학로/동묘', '28'],
  ['서울', '구로/신도림/가산/독산', '29'],
  //경기
  ['경기', '', '30'],
  ['경기', '가평/남양주/구리', '31'],
  ['경기', '고양', '32'],
  ['경기', '과천/안양/의왕/군포', '33'],
  ['경기', '김포', '34'],
  ['경기', '성남', '35'],
  ['경기', '수원', '36'],
  ['경기', '시흥/광명/부천', '37'],
  ['경기', '안산', '38'],
  ['경기', '의정부/양주/동두천/포천', '39'],
  ['경기', '여주/이천', '40'],
  ['경기', '오산/평택/안성/화성', '41'],
  ['경기', '용인', '42'],
  ['경기', '파주', '43'],
  ['경기', '하남/광주/양평', '44'],
  //인천
  ['인천', '', '45'],
  ['인천', '계양/서구', '46'],
  ['인천', '미추홀구/남동구/연수구', '47'],
  ['인천', '강화/옹진', '48'],
  ['인천', '동구/중구', '49'],
  ['인천', '부평', '50'],
];

const mainZoneList = ['서울', '경기', '인천'];

export class ZonePair {
  constructor(public main: string, public sub: string, public id: string) {}
}

class Zone {
  public getZone(zoneId: number) {
    return zoneMap[zoneId];
  }

  public getId(subZone: string) {
    let targetIndex = -1;
    zoneMap.some((value, index) => {
      if (value[1] === subZone) {
        targetIndex = index;
        return true;
      }
    });
    return targetIndex;
  }

  public getSubZoneList(mainZone: string): ZonePair[] {
    return zoneMap
      .filter(value => value[0] === mainZone && value[1] !== '')
      .map(value => new ZonePair(value[0], value[1], value[2]));
  }

  public getZoneList(): string[] {
    return mainZoneList;
  }
}

export default new Zone();
